#  1. Поработайте с переменными, создайте несколько, выведите на экран,
# запросите у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран.

name1 = 'Tommy'
name2 = 'Mike'

print(name1)
print(name2)

year = int(input('Введите год своего рождения: '))
number = int(input('Введите любое число: '))
name = input('Ваше имя: ')
city = input('В каком городе вы проживаете: ')

print('Год вашего рождения - ', year)
print('Ваше любимое число - ', number)
print('Ваше имя - ', name)
print('Вы проживаете в - ', city)
